{
  "metadata": {
    "total_parameters": 4205751296,
    "total_size": 8411502592
  },
  "weight_map": {
    "model.language_model.embed_tokens.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.0.input_layernorm.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.0.linear_attn.A_log": "model-00001-of-00005.safetensors",
    "model.language_model.layers.0.linear_attn.conv1d.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.0.linear_attn.dt_bias": "model-00001-of-00005.safetensors",
    "model.language_model.layers.0.linear_attn.in_proj_a.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.0.linear_attn.in_proj_b.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.0.linear_attn.in_proj_qkv.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.0.linear_attn.in_proj_z.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.0.linear_attn.norm.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.0.linear_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.0.mlp.down_proj.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.0.mlp.gate_proj.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.0.mlp.up_proj.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.0.post_attention_layernorm.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.1.input_layernorm.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.1.linear_attn.A_log": "model-00001-of-00005.safetensors",
    "model.language_model.layers.1.linear_attn.conv1d.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.1.linear_attn.dt_bias": "model-00001-of-00005.safetensors",
    "model.language_model.layers.1.linear_attn.in_proj_a.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.1.linear_attn.in_proj_b.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.1.linear_attn.in_proj_qkv.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.1.linear_attn.in_proj_z.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.1.linear_attn.norm.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.1.linear_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.1.mlp.down_proj.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.1.mlp.gate_proj.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.1.mlp.up_proj.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.1.post_attention_layernorm.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.10.input_layernorm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.10.linear_attn.A_log": "model-00002-of-00005.safetensors",
    "model.language_model.layers.10.linear_attn.conv1d.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.10.linear_attn.dt_bias": "model-00002-of-00005.safetensors",
    "model.language_model.layers.10.linear_attn.in_proj_a.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.10.linear_attn.in_proj_b.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.10.linear_attn.in_proj_qkv.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.10.linear_attn.in_proj_z.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.10.linear_attn.norm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.10.linear_attn.out_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.10.mlp.down_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.10.mlp.gate_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.10.mlp.up_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.10.post_attention_layernorm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.11.input_layernorm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.11.mlp.down_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.11.mlp.gate_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.11.mlp.up_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.11.post_attention_layernorm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.11.self_attn.k_norm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.11.self_attn.k_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.11.self_attn.o_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.11.self_attn.q_norm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.11.self_attn.q_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.11.self_attn.v_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.12.input_layernorm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.12.linear_attn.A_log": "model-00002-of-00005.safetensors",
    "model.language_model.layers.12.linear_attn.conv1d.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.12.linear_attn.dt_bias": "model-00002-of-00005.safetensors",
    "model.language_model.layers.12.linear_attn.in_proj_a.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.12.linear_attn.in_proj_b.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.12.linear_attn.in_proj_qkv.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.12.linear_attn.in_proj_z.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.12.linear_attn.norm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.12.linear_attn.out_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.12.mlp.down_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.12.mlp.gate_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.12.mlp.up_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.12.post_attention_layernorm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.13.input_layernorm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.13.linear_attn.A_log": "model-00003-of-00005.safetensors",
    "model.language_model.layers.13.linear_attn.conv1d.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.13.linear_attn.dt_bias": "model-00003-of-00005.safetensors",
    "model.language_model.layers.13.linear_attn.in_proj_a.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.13.linear_attn.in_proj_b.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.13.linear_attn.in_proj_qkv.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.13.linear_attn.in_proj_z.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.13.linear_attn.norm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.13.linear_attn.out_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.13.mlp.down_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.13.mlp.gate_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.13.mlp.up_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.13.post_attention_layernorm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.14.input_layernorm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.14.linear_attn.A_log": "model-00003-of-00005.safetensors",
    "model.language_model.layers.14.linear_attn.conv1d.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.14.linear_attn.dt_bias": "model-00003-of-00005.safetensors",
    "model.language_model.layers.14.linear_attn.in_proj_a.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.14.linear_attn.in_proj_b.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.14.linear_attn.in_proj_qkv.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.14.linear_attn.in_proj_z.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.14.linear_attn.norm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.14.linear_attn.out_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.14.mlp.down_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.14.mlp.gate_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.14.mlp.up_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.14.post_attention_layernorm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.15.input_layernorm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.15.mlp.down_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.15.mlp.gate_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.15.mlp.up_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.15.post_attention_layernorm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.15.self_attn.k_norm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.15.self_attn.k_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.15.self_attn.o_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.15.self_attn.q_norm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.15.self_attn.q_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.15.self_attn.v_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.16.input_layernorm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.16.linear_attn.A_log": "model-00003-of-00005.safetensors",
    "model.language_model.layers.16.linear_attn.conv1d.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.16.linear_attn.dt_bias": "model-00003-of-00005.safetensors",
    "model.language_model.layers.16.linear_attn.in_proj_a.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.16.linear_attn.in_proj_b.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.16.linear_attn.in_proj_qkv.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.16.linear_attn.in_proj_z.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.16.linear_attn.norm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.16.linear_attn.out_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.16.mlp.down_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.16.mlp.gate_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.16.mlp.up_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.16.post_attention_layernorm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.17.input_layernorm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.17.linear_attn.A_log": "model-00003-of-00005.safetensors",
    "model.language_model.layers.17.linear_attn.conv1d.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.17.linear_attn.dt_bias": "model-00003-of-00005.safetensors",
    "model.language_model.layers.17.linear_attn.in_proj_a.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.17.linear_attn.in_proj_b.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.17.linear_attn.in_proj_qkv.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.17.linear_attn.in_proj_z.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.17.linear_attn.norm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.17.linear_attn.out_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.17.mlp.down_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.17.mlp.gate_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.17.mlp.up_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.17.post_attention_layernorm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.18.input_layernorm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.18.linear_attn.A_log": "model-00003-of-00005.safetensors",
    "model.language_model.layers.18.linear_attn.conv1d.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.18.linear_attn.dt_bias": "model-00003-of-00005.safetensors",
    "model.language_model.layers.18.linear_attn.in_proj_a.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.18.linear_attn.in_proj_b.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.18.linear_attn.in_proj_qkv.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.18.linear_attn.in_proj_z.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.18.linear_attn.norm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.18.linear_attn.out_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.18.mlp.down_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.18.mlp.gate_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.18.mlp.up_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.18.post_attention_layernorm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.19.input_layernorm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.19.mlp.down_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.19.mlp.gate_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.19.mlp.up_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.19.post_attention_layernorm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.19.self_attn.k_norm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.19.self_attn.k_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.19.self_attn.o_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.19.self_attn.q_norm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.19.self_attn.q_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.19.self_attn.v_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.2.input_layernorm.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.2.linear_attn.A_log": "model-00001-of-00005.safetensors",
    "model.language_model.layers.2.linear_attn.conv1d.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.2.linear_attn.dt_bias": "model-00001-of-00005.safetensors",
    "model.language_model.layers.2.linear_attn.in_proj_a.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.2.linear_attn.in_proj_b.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.2.linear_attn.in_proj_qkv.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.2.linear_attn.in_proj_z.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.2.linear_attn.norm.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.2.linear_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.2.mlp.down_proj.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.2.mlp.gate_proj.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.2.mlp.up_proj.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.2.post_attention_layernorm.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.20.input_layernorm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.20.linear_attn.A_log": "model-00003-of-00005.safetensors",
    "model.language_model.layers.20.linear_attn.conv1d.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.20.linear_attn.dt_bias": "model-00003-of-00005.safetensors",
    "model.language_model.layers.20.linear_attn.in_proj_a.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.20.linear_attn.in_proj_b.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.20.linear_attn.in_proj_qkv.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.20.linear_attn.in_proj_z.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.20.linear_attn.norm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.20.linear_attn.out_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.20.mlp.down_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.20.mlp.gate_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.20.mlp.up_proj.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.20.post_attention_layernorm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.21.input_layernorm.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.21.linear_attn.A_log": "model-00003-of-00005.safetensors",
    "model.language_model.layers.21.linear_attn.conv1d.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.21.linear_attn.dt_bias": "model-00003-of-00005.safetensors",
    "model.language_model.layers.21.linear_attn.in_proj_a.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.21.linear_attn.in_proj_b.weight": "model-00003-of-00005.safetensors",
    "model.language_model.layers.21.linear_attn.in_proj_qkv.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.21.linear_attn.in_proj_z.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.21.linear_attn.norm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.21.linear_attn.out_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.21.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.21.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.21.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.21.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.22.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.22.linear_attn.A_log": "model-00004-of-00005.safetensors",
    "model.language_model.layers.22.linear_attn.conv1d.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.22.linear_attn.dt_bias": "model-00004-of-00005.safetensors",
    "model.language_model.layers.22.linear_attn.in_proj_a.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.22.linear_attn.in_proj_b.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.22.linear_attn.in_proj_qkv.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.22.linear_attn.in_proj_z.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.22.linear_attn.norm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.22.linear_attn.out_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.22.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.22.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.22.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.22.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.23.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.23.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.23.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.23.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.23.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.23.self_attn.k_norm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.23.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.23.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.23.self_attn.q_norm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.23.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.23.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.24.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.24.linear_attn.A_log": "model-00004-of-00005.safetensors",
    "model.language_model.layers.24.linear_attn.conv1d.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.24.linear_attn.dt_bias": "model-00004-of-00005.safetensors",
    "model.language_model.layers.24.linear_attn.in_proj_a.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.24.linear_attn.in_proj_b.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.24.linear_attn.in_proj_qkv.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.24.linear_attn.in_proj_z.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.24.linear_attn.norm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.24.linear_attn.out_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.24.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.24.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.24.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.24.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.25.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.25.linear_attn.A_log": "model-00004-of-00005.safetensors",
    "model.language_model.layers.25.linear_attn.conv1d.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.25.linear_attn.dt_bias": "model-00004-of-00005.safetensors",
    "model.language_model.layers.25.linear_attn.in_proj_a.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.25.linear_attn.in_proj_b.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.25.linear_attn.in_proj_qkv.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.25.linear_attn.in_proj_z.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.25.linear_attn.norm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.25.linear_attn.out_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.25.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.25.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.25.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.25.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.26.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.26.linear_attn.A_log": "model-00004-of-00005.safetensors",
    "model.language_model.layers.26.linear_attn.conv1d.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.26.linear_attn.dt_bias": "model-00004-of-00005.safetensors",
    "model.language_model.layers.26.linear_attn.in_proj_a.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.26.linear_attn.in_proj_b.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.26.linear_attn.in_proj_qkv.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.26.linear_attn.in_proj_z.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.26.linear_attn.norm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.26.linear_attn.out_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.26.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.26.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.26.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.26.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.27.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.27.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.27.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.27.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.27.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.27.self_attn.k_norm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.27.self_attn.k_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.27.self_attn.o_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.27.self_attn.q_norm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.27.self_attn.q_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.27.self_attn.v_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.28.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.28.linear_attn.A_log": "model-00004-of-00005.safetensors",
    "model.language_model.layers.28.linear_attn.conv1d.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.28.linear_attn.dt_bias": "model-00004-of-00005.safetensors",
    "model.language_model.layers.28.linear_attn.in_proj_a.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.28.linear_attn.in_proj_b.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.28.linear_attn.in_proj_qkv.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.28.linear_attn.in_proj_z.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.28.linear_attn.norm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.28.linear_attn.out_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.28.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.28.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.28.mlp.up_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.28.post_attention_layernorm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.29.input_layernorm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.29.linear_attn.A_log": "model-00004-of-00005.safetensors",
    "model.language_model.layers.29.linear_attn.conv1d.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.29.linear_attn.dt_bias": "model-00004-of-00005.safetensors",
    "model.language_model.layers.29.linear_attn.in_proj_a.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.29.linear_attn.in_proj_b.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.29.linear_attn.in_proj_qkv.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.29.linear_attn.in_proj_z.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.29.linear_attn.norm.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.29.linear_attn.out_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.29.mlp.down_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.29.mlp.gate_proj.weight": "model-00004-of-00005.safetensors",
    "model.language_model.layers.29.mlp.up_proj.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.29.post_attention_layernorm.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.3.input_layernorm.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.3.mlp.down_proj.weight": "model-00001-of-00005.safetensors",
    "model.language_model.layers.3.mlp.gate_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.3.mlp.up_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.3.post_attention_layernorm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.3.self_attn.k_norm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.3.self_attn.k_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.3.self_attn.o_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.3.self_attn.q_norm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.3.self_attn.q_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.3.self_attn.v_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.30.input_layernorm.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.30.linear_attn.A_log": "model-00005-of-00005.safetensors",
    "model.language_model.layers.30.linear_attn.conv1d.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.30.linear_attn.dt_bias": "model-00005-of-00005.safetensors",
    "model.language_model.layers.30.linear_attn.in_proj_a.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.30.linear_attn.in_proj_b.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.30.linear_attn.in_proj_qkv.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.30.linear_attn.in_proj_z.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.30.linear_attn.norm.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.30.linear_attn.out_proj.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.30.mlp.down_proj.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.30.mlp.gate_proj.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.30.mlp.up_proj.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.30.post_attention_layernorm.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.31.input_layernorm.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.31.mlp.down_proj.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.31.mlp.gate_proj.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.31.mlp.up_proj.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.31.post_attention_layernorm.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.31.self_attn.k_norm.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.31.self_attn.k_proj.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.31.self_attn.o_proj.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.31.self_attn.q_norm.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.31.self_attn.q_proj.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.31.self_attn.v_proj.weight": "model-00005-of-00005.safetensors",
    "model.language_model.layers.4.input_layernorm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.4.linear_attn.A_log": "model-00002-of-00005.safetensors",
    "model.language_model.layers.4.linear_attn.conv1d.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.4.linear_attn.dt_bias": "model-00002-of-00005.safetensors",
    "model.language_model.layers.4.linear_attn.in_proj_a.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.4.linear_attn.in_proj_b.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.4.linear_attn.in_proj_qkv.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.4.linear_attn.in_proj_z.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.4.linear_attn.norm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.4.linear_attn.out_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.4.mlp.down_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.4.mlp.gate_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.4.mlp.up_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.4.post_attention_layernorm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.5.input_layernorm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.5.linear_attn.A_log": "model-00002-of-00005.safetensors",
    "model.language_model.layers.5.linear_attn.conv1d.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.5.linear_attn.dt_bias": "model-00002-of-00005.safetensors",
    "model.language_model.layers.5.linear_attn.in_proj_a.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.5.linear_attn.in_proj_b.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.5.linear_attn.in_proj_qkv.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.5.linear_attn.in_proj_z.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.5.linear_attn.norm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.5.linear_attn.out_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.5.mlp.down_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.5.mlp.gate_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.5.mlp.up_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.5.post_attention_layernorm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.6.input_layernorm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.6.linear_attn.A_log": "model-00002-of-00005.safetensors",
    "model.language_model.layers.6.linear_attn.conv1d.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.6.linear_attn.dt_bias": "model-00002-of-00005.safetensors",
    "model.language_model.layers.6.linear_attn.in_proj_a.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.6.linear_attn.in_proj_b.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.6.linear_attn.in_proj_qkv.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.6.linear_attn.in_proj_z.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.6.linear_attn.norm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.6.linear_attn.out_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.6.mlp.down_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.6.mlp.gate_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.6.mlp.up_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.6.post_attention_layernorm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.7.input_layernorm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.7.mlp.down_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.7.mlp.gate_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.7.mlp.up_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.7.post_attention_layernorm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.7.self_attn.k_norm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.7.self_attn.k_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.7.self_attn.o_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.7.self_attn.q_norm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.7.self_attn.q_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.7.self_attn.v_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.8.input_layernorm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.8.linear_attn.A_log": "model-00002-of-00005.safetensors",
    "model.language_model.layers.8.linear_attn.conv1d.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.8.linear_attn.dt_bias": "model-00002-of-00005.safetensors",
    "model.language_model.layers.8.linear_attn.in_proj_a.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.8.linear_attn.in_proj_b.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.8.linear_attn.in_proj_qkv.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.8.linear_attn.in_proj_z.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.8.linear_attn.norm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.8.linear_attn.out_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.8.mlp.down_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.8.mlp.gate_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.8.mlp.up_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.8.post_attention_layernorm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.9.input_layernorm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.9.linear_attn.A_log": "model-00002-of-00005.safetensors",
    "model.language_model.layers.9.linear_attn.conv1d.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.9.linear_attn.dt_bias": "model-00002-of-00005.safetensors",
    "model.language_model.layers.9.linear_attn.in_proj_a.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.9.linear_attn.in_proj_b.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.9.linear_attn.in_proj_qkv.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.9.linear_attn.in_proj_z.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.9.linear_attn.norm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.9.linear_attn.out_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.9.mlp.down_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.9.mlp.gate_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.9.mlp.up_proj.weight": "model-00002-of-00005.safetensors",
    "model.language_model.layers.9.post_attention_layernorm.weight": "model-00002-of-00005.safetensors",
    "model.language_model.norm.weight": "model-00005-of-00005.safetensors"
  }
}
